 #1
s = int( input("Введіть рядок: "))
d = int (input("Введіть рядок: "))
g = int (input("Введіть рядок: "))
# # #a
print(f'{s}{d}{g}')
# # #b
print(str(s)+str(d)+str(g))

#2
a= str(int( input("Введіть рядок: ")))
print (f'Добуток: {int(a[0]) * int(a[1]) * int(a[2]) * int(a[3])}')
#3
b= int( input("Метри: "))
print(f'Конвертування метрів у сантиметри: {b*100}')
print(f'Конвертування метрів у дециметри: {b*10} ')
print(f'Конвертування метрів у меліметри: {b*1000} ')
print(f'Конвертування метрів у милі: {round(b/1609.34, 2)} ')
#4
s = int( input(" Основа трикутника: "))
d = int (input("Висота трикутника: "))
print(f'Площа трикутника: {1/2*s*d}')
#5
j = str( int ( input("Введіть число: ")))
print(f'Зеркальний вивід: {j[::-1]}')

