# 1. Вступ. Змінні (variable) - 'коробка' з даними
print('Hello World!')   # print - це функція, що виводить інформацію в консоль
#name = input("Enter your name") # створення змінної з значенням "Nadiya" # input  повертає результат
#print ('Hello,' + name)
#print (f"Hello,{name}") # f використов для різних типів даних


'''
Створення змінних:
1. Пробіли не можна 
2. Нижнє підкреслювання 
3. Так називаємо класи MyName
4. Цифри можна. Але не на початку (n1, number_1)
5. Змінна називається так, щоб по назві був зрозумілий її зміст 

'''
#Базові операції
n = 1
print (n + 10)
resolt = n - 1 # Створюємо змінну resolt, в яку вкладаємо результат n -1
print (resolt)

print(n*5) #множення
print(n/3) #ділення

#Перезапис змінної

num =10
num =20
num =30
num = reply = num
print(num)
print(num)
print(reply) #копіювання

print(num)





