import numpy as np

# # ====================== Замір швидкості
# R = 250_000_000
#
# s = time.time()
# python = list(range(R))
# e = time.time()
# print(f'Python: {e - s}')
#
# s = time.time()
# c = np.arange(R)
# e = time.time()
# print(f'NumPy: {e - s}')

# Створення масиву
arr1 = np.array([1, '2', 3, 4, 5], dtype='float')
print(arr1)

double_array = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
print(double_array)

# Основні властивості (property) масиву ndarray
print(double_array.ndim)  # вимірність масиву
print(double_array.shape)  # форма (кількість рядків, кількість колонок)
print(double_array.size)  # загальна кількість елементів
print(double_array.dtype)  # тип даних масиву
print(double_array.itemsize)  # розмір в байтах 🤔

# Створення інших видів масиву
print(np.ones((5, 10)))  # масив одиниць (вказується розмірність shape)
print(np.zeros((2, 3, 4)))  # масив нулів

print(np.arange(10))  # аналог list(range) в пайтоні
print(np.arange(1, 20))  # можна вказати межі

# Рандом
np.random.seed(10_000)  # ручне налаштування випадкового зерна

print(np.random.rand(4, 5))  # рандомний масив у shape розмірі від 0 до 1
print(np.random.randint(-100, 100, size=(3, 3)))  # більш "людський" рандом

print(np.random.choice(['a', 'b', 'c', 'd', 'e'], size=(3, 3), p=[0, 0.05, 0.05, 0.5, 0.4]))
# Рандомний вибір з послідовності, що формує масив розмірності size, можна впливати на рандом
# через p= (кількість елементів=кількості елементів послідовності, а сума = 1)

print('====================================')
# Робота з двома масивами, порівняння
a = np.array([[1, 2, 3], [4, 5, 6]])
b = np.array([[1, 15, 7], [7, 18, 1000]])
c = np.ones((2, 3))

print(a)
print(b)

print(a + b)
print(a * b)

# Булевна індексація та булевні маски
print(b > 10)
print(b[b > 10])

# Функції
print(np.min(b))
print(np.max(b))
print(np.sum(b))

print(np.prod(b))  # добуток
print(np.median(b))  # медіана
print(np.mean(b))  # середнє

print(np.std(c))  # стандартне відхилення
