'''
Числовий	ціле число, число з плаваючою комою, комплексне число	містить числові значення
Рядок	вул.	містить послідовність символів
Послідовність	список, кортеж, діапазон	зберігає колекцію предметів
Картування	диктант	зберігає дані у формі пари ключ-значення
Булеве значення	логічна змінна	має TrueабоFalse
Набір	набір, заморожений набір	зберігати колекцію унікальних предметів
'''
# | Звідки ➡️ Куди     | Приклад                                       | Результат                              |
# | ------------------ | --------------------------------------------- | -------------------------------------- |
# | `int → float`      | `float(5)`                                    | `5.0`                                  |
# | `float → int`      | `int(3.9)`                                    | `3` (обрізає дробову частину)          |
# | `int → str`        | `str(42)`                                     | `'42'`                                 |
# | `str → int`        | `int("42")`                                   | `42`                                   |
# | `str → float`      | `float("3.14")`                               | `3.14`                                 |
# | `float → str`      | `str(2.5)`                                    | `'2.5'`                                |
# | `int/float → bool` | `bool(0)` → `False`<br>`bool(7)` → `True`     |                                        |
# | `str → bool`       | `bool("")` → `False`<br>`bool("hi")` → `True` |                                        |
# | `list → tuple`     | `tuple([1,2,3])`                              | `(1, 2, 3)`                            |
# | `tuple → list`     | `list((1,2,3))`                               | `[1, 2, 3]`                            |
# | `set → list`       | `list({1,2,3})`                               | `[1, 2, 3]` (порядок може змінюватись) |
# | `list → set`       | `set([1,2,2,3])`                              | `{1, 2, 3}` (дублікати зникають)       |
#11
text = input("Введіть текст: ")
numbers = set("0123456789")
if set(text) & numbers:
    print("У тексті є цифри.")
else:
    print("Цифр немає.")

