# 1. Користувач вводить строку.
# Розділіть строку навпіл та окремо надрукуйте дві її частини.
# Приклад: 'Python' -> 'Pyt'      'hon'
text = input("Введіть рядок: ")

mid = len(text) +1 // 2   # середина рядка

left = text[:mid]      # перша половина
right = text[mid:]     # друга половина

print(left, right)

# # 2. Користувач вводить дві строки.
# # Помістіть першу строку у середину другої.
# # Приклад: '!!!', 'python' -> 'pyt!!!hon'

text1 = input("Введіть перший рядок: ")   # те, що вставляємо
text2 = input("Введіть другий рядок: ")   # куди вставляємо

mid = len(text2) +1 // 2                     # середина другого рядка

result = text2[:mid] + text1 + text2[mid:]      # ліва частина + вставка + права частина

print(result)

# 3. Є рядок "123456789".
#
# Отримай підрядок із парними цифрами.
# Отримай підрядок із непарними цифрами.

#sequence[start:stop:step]
# start – з якого індексу почати (включно)
#
# stop – до якого індексу (не включається)
#
# step – крок

num = "123456789"

even_digits = num[1::2]   # парні
odd_digits = num[0::2]    # непарні

print("Парні:", even_digits)
print("Непарні:", odd_digits)

# 4. Користувач вводить строку
#
# Виведи кожен другий символ.
# Виведи символи з індексів від 2 до 6.
# Виведи рядок без перших двох і останніх двох символів.

s = input("Введіть рядок: ")


print("Кожен другий символ:", s[::2])


print("З індексів 2–6:", s[2:7])


print("Без перших двох і останніх двох:", s[2:-2])

