
'''
# 1.
Змінна — це «коробочка» в памяті компютера, де зберігається значення (число, текст тощо).
Python це дозволяє, бо він  динамічно типізована мова.

#2. Чи обов’язковий else у конструкції умов?
Ні, else не обовязковий. else використовується, коли жодна інша умова не спрацювала.

#3. Які типи даних є в Python?
int — цілі числа (10, 3)
float — числа з крапкою (3.14, -0.5)
str — рядки ("hello")
bool — логічні значення (True, False)
Використовується за різним призначенням.
#4. Чи можна вкладати if-elif-else одне в одне?
Так, можна. Це називається вкладені умовні конструкції.

'''
